{
  "ir_version": 1,
  "project_id": "prism",
  "apps": [
    {
      "id": "unblock",
      "version": "0.3.0",
      "objects": [
        {
          "app_id": "unblock",
          "name": "Project",
          "semantic_id": "unblock.object.Project",
          "table": {
            "name": "projects",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "name",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "description",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "projects_by_archive",
                "columns": [
                  "archived_at",
                  "id"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "archived_at": "explicit",
            "created_at": "explicit",
            "description": "explicit",
            "id": "explicit",
            "name": "explicit",
            "updated_at": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "Task",
          "semantic_id": "unblock.object.Task",
          "table": {
            "name": "tasks",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "title",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "description",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "lifecycle",
                "ty": {
                  "kind": "enum",
                  "name": "Lifecycle",
                  "values": [
                    "open",
                    "started",
                    "finished"
                  ]
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "priority",
                "ty": {
                  "kind": "i32"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "size",
                "ty": {
                  "kind": "enum",
                  "name": "TaskSize",
                  "values": [
                    "XS",
                    "S",
                    "M",
                    "L",
                    "XL"
                  ]
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "source_doc",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "source_section",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "source_anchor",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "source_line",
                "ty": {
                  "kind": "i32"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "source_text",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "completion_bar",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "started_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "finished_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "version",
                "ty": {
                  "kind": "i64"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "tasks_by_project",
                "columns": [
                  "project_id",
                  "id"
                ],
                "unique": true,
                "method": "b_tree"
              },
              {
                "name": "tasks_by_project_lifecycle",
                "columns": [
                  "project_id",
                  "lifecycle",
                  "archived_at"
                ],
                "unique": false,
                "method": "b_tree"
              },
              {
                "name": "tasks_by_project_source",
                "columns": [
                  "project_id",
                  "source_doc",
                  "source_section"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "archived_at": "explicit",
            "completion_bar": "explicit",
            "created_at": "explicit",
            "description": "explicit",
            "finished_at": "explicit",
            "id": "explicit",
            "lifecycle": "explicit",
            "priority": "explicit",
            "project_id": "explicit",
            "size": "explicit",
            "source_anchor": "explicit",
            "source_doc": "explicit",
            "source_line": "explicit",
            "source_section": "explicit",
            "source_text": "explicit",
            "started_at": "explicit",
            "title": "explicit",
            "updated_at": "explicit",
            "version": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "Track",
          "semantic_id": "unblock.object.Track",
          "table": {
            "name": "tracks",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "machine",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "actor",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "name",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "tracks_by_actor",
                "columns": [
                  "project_id",
                  "machine",
                  "actor"
                ],
                "unique": true,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "actor": "explicit",
            "archived_at": "explicit",
            "created_at": "explicit",
            "id": "explicit",
            "machine": "explicit",
            "name": "explicit",
            "project_id": "explicit",
            "updated_at": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "Comment",
          "semantic_id": "unblock.object.Comment",
          "table": {
            "name": "comments",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "machine",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "actor",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "body",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "comments_by_task",
                "columns": [
                  "project_id",
                  "task_id",
                  "created_at"
                ],
                "unique": false,
                "method": "b_tree"
              },
              {
                "name": "comments_by_actor",
                "columns": [
                  "project_id",
                  "machine",
                  "actor",
                  "created_at"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "actor": "explicit",
            "archived_at": "explicit",
            "body": "explicit",
            "created_at": "explicit",
            "id": "explicit",
            "machine": "explicit",
            "project_id": "explicit",
            "task_id": "explicit",
            "updated_at": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "Instruction",
          "semantic_id": "unblock.object.Instruction",
          "table": {
            "name": "instructions",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "name",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_text",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_hash",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_fragment_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_fragment_hash",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "body",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "enabled",
                "ty": {
                  "kind": "bool"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "instructions_by_name",
                "columns": [
                  "project_id",
                  "name"
                ],
                "unique": true,
                "method": "b_tree"
              },
              {
                "name": "instructions_by_selector",
                "columns": [
                  "project_id",
                  "selector_hash"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "archived_at": "explicit",
            "body": "explicit",
            "created_at": "explicit",
            "enabled": "explicit",
            "id": "explicit",
            "name": "explicit",
            "project_id": "explicit",
            "selector_fragment_hash": "explicit",
            "selector_fragment_id": "explicit",
            "selector_hash": "explicit",
            "selector_text": "explicit",
            "updated_at": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "SavedSelector",
          "semantic_id": "unblock.object.SavedSelector",
          "table": {
            "name": "savedselectors",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "kind",
                "ty": {
                  "kind": "enum",
                  "name": "SelectorKind",
                  "values": [
                    "instruction",
                    "view",
                    "feed"
                  ]
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "name",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_text",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_hash",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_fragment_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "selector_fragment_hash",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "saved_selectors_by_kind_name",
                "columns": [
                  "project_id",
                  "kind",
                  "name"
                ],
                "unique": true,
                "method": "b_tree"
              },
              {
                "name": "saved_selectors_by_fragment",
                "columns": [
                  "project_id",
                  "selector_fragment_hash"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "archived_at": "explicit",
            "created_at": "explicit",
            "id": "explicit",
            "kind": "explicit",
            "name": "explicit",
            "project_id": "explicit",
            "selector_fragment_hash": "explicit",
            "selector_fragment_id": "explicit",
            "selector_hash": "explicit",
            "selector_text": "explicit",
            "updated_at": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "ExternalIssue",
          "semantic_id": "unblock.object.ExternalIssue",
          "table": {
            "name": "externalissues",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provider",
                "ty": {
                  "kind": "enum",
                  "name": "ExternalProvider",
                  "values": [
                    "github",
                    "jira",
                    "linear",
                    "asana",
                    "trello",
                    "manual"
                  ]
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "external_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "external_key",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "url",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "title",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "state",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "payload",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "synced_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "archived_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "external_issues_by_provider",
                "columns": [
                  "project_id",
                  "provider",
                  "external_id"
                ],
                "unique": true,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "archived_at": "explicit",
            "external_id": "explicit",
            "external_key": "explicit",
            "id": "explicit",
            "payload": "explicit",
            "project_id": "explicit",
            "provider": "explicit",
            "state": "explicit",
            "synced_at": "explicit",
            "title": "explicit",
            "url": "explicit"
          }
        },
        {
          "app_id": "unblock",
          "name": "ActivityEvent",
          "semantic_id": "unblock.object.ActivityEvent",
          "table": {
            "name": "activityevents",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "type",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "subject",
                "ty": {
                  "kind": "enum",
                  "name": "ActivitySubject",
                  "values": [
                    "project",
                    "task",
                    "comment",
                    "tag",
                    "track",
                    "instruction",
                    "view",
                    "feed",
                    "external_issue",
                    "import",
                    "export",
                    "system"
                  ]
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "subject_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "message",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "data",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "machine",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "actor",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "id"
            ],
            "indexes": [
              {
                "name": "activity_by_project_time",
                "columns": [
                  "project_id",
                  "created_at"
                ],
                "unique": false,
                "method": "b_tree"
              },
              {
                "name": "activity_by_subject",
                "columns": [
                  "project_id",
                  "subject",
                  "subject_id",
                  "created_at"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "key": {
            "columns": [
              "id"
            ],
            "policy": "semantic"
          },
          "routing": {
            "kind": "by_column",
            "column": "project_id"
          },
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          },
          "field_sources": {
            "actor": "explicit",
            "created_at": "explicit",
            "data": "explicit",
            "id": "explicit",
            "machine": "explicit",
            "message": "explicit",
            "project_id": "explicit",
            "subject": "explicit",
            "subject_id": "explicit",
            "type": "explicit"
          }
        }
      ],
      "relations": [
        {
          "app_id": "unblock",
          "name": "TaskDependsOnTask",
          "semantic_id": "unblock.relation.TaskDependsOnTask",
          "table": {
            "name": "taskdependsontask",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "from_task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "to_task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "from_task_id",
              "to_task_id"
            ],
            "indexes": [
              {
                "name": "taskdependsontask_from_idx",
                "columns": [
                  "from_task_id"
                ],
                "unique": false,
                "method": "b_tree"
              },
              {
                "name": "taskdependsontask_to_idx",
                "columns": [
                  "to_task_id"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "from": {
            "role": "from",
            "object": "Task",
            "endpoint_kind": "object",
            "column": "from_task_id",
            "required": true
          },
          "to": {
            "role": "to",
            "object": "Task",
            "endpoint_kind": "object",
            "column": "to_task_id",
            "required": true
          },
          "cardinality": "many_to_many",
          "shard_policy": "stored_on_from",
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          }
        },
        {
          "app_id": "unblock",
          "name": "TaskContainsTask",
          "semantic_id": "unblock.relation.TaskContainsTask",
          "table": {
            "name": "taskcontainstask",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "from_task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "to_task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "sort_key",
                "ty": {
                  "kind": "text"
                },
                "nullable": true,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "created_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "updated_at",
                "ty": {
                  "kind": "timestamp"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "provenance",
                "ty": {
                  "kind": "json"
                },
                "nullable": false,
                "default_sql": "'{}'::jsonb",
                "generated": false
              }
            ],
            "primary_key": [
              "project_id",
              "shard_id",
              "from_task_id",
              "to_task_id"
            ],
            "indexes": [
              {
                "name": "taskcontainstask_from_idx",
                "columns": [
                  "from_task_id"
                ],
                "unique": false,
                "method": "b_tree"
              },
              {
                "name": "taskcontainstask_to_idx",
                "columns": [
                  "to_task_id"
                ],
                "unique": false,
                "method": "b_tree"
              }
            ],
            "checks": []
          },
          "from": {
            "role": "from",
            "object": "Task",
            "endpoint_kind": "object",
            "column": "from_task_id",
            "required": true
          },
          "to": {
            "role": "to",
            "object": "Task",
            "endpoint_kind": "object",
            "column": "to_task_id",
            "required": true
          },
          "cardinality": "one_to_many",
          "shard_policy": "stored_on_from",
          "lifecycle": {
            "tombstone_column": null,
            "hard_delete_allowed": true
          }
        },
        {
          "app_id": "unblock",
          "name": "TaskAssignedToTrack",
          "semantic_id": "unblock.relation.TaskAssignedToTrack",
          "table": {
            "name": "taskassignedtotrack",
            "columns": [
              {
                "name": "project_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "shard_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "from_task_id",
                "ty": {
                  "kind": "text"
                },
                "nullable": false,
                "default_sql": null,
                "generated": false
              },
              {
                "name": "to_track_id",
                "ty": {
